# ถ้ามีมีจำนอนรอบในการจะวนหลูบที่ชัดเจนแนะนำให้ใช้ For จะง่ายกว่า

#continue = ไม่ทำคำสั่งต่อไปในloopและวนใหม่กว่าจะจบ


i = 1 # ตัวนับจำนวนรอบ

while i<=4:
    print("รอบที่",i)
    i=i+1 # 2,3,4
    print("จบโปรแกรม")

print("จุ๊ปๆ")


"""

ยกตัวอย่างการใช้คำสั่ง While วนหลูบ

เช่น การนำเลข 0 มา+1 จะได้ 1 แล้วก็แสดงข้อความออกมาก่อนละก็ +อีก 1 ได้ 2 
ตำสั่ง While ก็จะนำนำ 2 ที่ได้ไปดูว่าถูกตามสิ่งที่กำหนดไหม(p<=count) ละก็วนหลูบไปเรื่อยๆ

"""


p = 1 # ตัวนับจำนวนรอบ
summation = 0 # เก็บผลการบวกเลขตามจำนวนรวม
average = 0
#1+2+3+4+5


count = int(input("โปรดระบุจำนวนรอบ :"))

while p<=count:
    summation+=p # เก็บผลรวมของ 1 แต่ละรอบ 1 + 2+3
    print("รอบที่ = ",p,"ค่า SUM",summation) # ละก็โชว์ข้อความก่อนค่อย +1
    p+=1 # 1,2,3,4,5

average = summation/10
print("ผลรวมการบวกเลข = ",summation)
print("ค่าเฉลี่ย = ",average)


print("จบ")


#การทำซ้ำเป็นคำสั่ง For (ง่ายกว่าใช้ While ถ้ามีจำนวนรอบที่จัดเจน)
#ยกตัวอย่างการใช้ For

#for in range(start,stop,step) #กำหนดรอบ

#ตัวมันจะเริ่มนับจากเลข 0ถึงเลขที่กำหนด



for i in range(3): # 0,1,2 (start,stop,step)
    print("รอบที่ =",i,"Hello World")

#กำหนดรอบอีกแบบแต่ไม่นิยม เช่น
for i in range(1,6): #ก็จะแสดงคำว่า ชิกดูส ออกมาแค่่ 5 ตัว เพราะเริ่มนับจาก 1จบที่ 6 (ไม่นับ 6 เข้าด้วย)
    print("ชิกดูส")

#เหรือจะเริ่มที่เลขติดลบก็ได้ (ถึงจะไม่รู้ว่าจะทำไปให้มันยุ่งยากกับชีวิตทำไมก็เหอะ)
for i in range(-10,6,2):
    print("รอบที่ =",i)

print("จบโปรแกรม For")



#Loop ซ้อน Loop while

i = 1

while i<=3:
    j=1
    while j<=5:
        print("รอบที่ =",i,"ตำแหน่งที่ =",j)
        j+=1
    i+=1
print("จบ Loop ซ้อน Loop While")


#Loop ซ้อน Loop For

for i in range(1,4):
    print("รอบที่ =",i)
    for j in range(1,6):
        print("ตำแหน่ง =",j)

print("จบหลักการต่อที่การยกตัวอย่าง")


#ดูเลขที่มากสุดแบบกากๆ
max ,min = 0,9999

while True :
  number=int(input("ป้อนตัวเลขของคุณ :"))
  #กระโดดออกจากLoop
  if number<0 :
    break
  if number>max :
    max=number
  if number<min :
    min=number

print("ค่าสูงสุด =",max)
print("ค่าสูงสุด =",min)

"""

                                สรุป
        While ถ้าข้อมูลเป็นจริง(True)ถึงจะเข้าไปในLoop
        For   ต้องกำหนดจุดสิ้นสุดเป็นอย่างน้อยหรือเพิ่มจุดเริ่ม (start,stop,step)
        
"""