# คัวดำเนินการ & ตัวที่ถูกดำเนินการ
# Operator / Operand

# A+B
#A,B=Operand
# + =Operator

x = 10
y = 4

print("ผลบวก", x + y)
print("ผลลบ", x - y)
print("ผลคูณ", x * y)
print("ผลหาร", x / y)
print("หารปัดเศษ", x // y)
print("ยกกำลัง", 5**2)
print("หารเอาแค่เศษ", x % y)

#นำข้อมูลอย่างน้อยสองค่ามาเปรียบเทียบกัน
#ชนิดของข้อมูลเหมือนกัน
#คำตอบ/คำตอบ => จริง / เท็จ

o, m = 10, 5

print("ค่า x ค่ามากกว่า y หรือไม่? :", x > y)
print("ค่า x น้อยกว่าค่า y หรือไม่? :", x < y)
print("ค่า x เท่ากับค่า y หรือไม่? :", x == y)
print("ค่า x ไม่เท่ากับ y หรือไม่? :", x != y)

print("ค่า x มากกว่าหรือเท่ากับ y หรือไม่? :", x >= y)
print("ค่า x น้อยกว่าหรือเท่ากับ y หรือไม่? :", x <= y)

#การเปรียบเทียบข้อมูลมากกว่า2ค่า
#ต้องถูกทุกข้อมูลถึงจะตอบว่าTrue
a, b, c = 8, 7, 9

print("ค่า a มากกว่า b และ b มากกว่า c หรือไม่? :", a > b > c)
print("ค่า a น้อยกว่า b และ b น้อยกว่า c หรือไม่? :", a < b < c)

#ตัวดำเนินการทางตรรกศาสตร์ Logic
#and = และ
#or = หรือ
#not = ไม่
#คำตอบที่ได้ = จริง1 / เท็จ0

#การใช้ AND
#ถ้ามีเท็จอยู่ด้วยแม้แต่ตัวเดียวก็จะตอบว่าเท็จ
p = (5 > 10)  #ค่า p = bool
h = (10 == 5)  #ค่า h = bool
print(p)
print(h)

#z = (5>10) and (10==5)
z = p and h

print(z)

#การใช้ OR
#ถ้าเป็นจริงแม้แต่ตัวเดียวก็ตอบว่าจริงต้องเท็จทั้งหมดเท่านั้นถึงจะตอบว่าเท็จ

#การใช้ NOT
#NOTคือคั่วตรงข้าม
#จริง=เท็จ / เท็จ=จริง

q = (5 + 2) * 10 / 2

print(q)
